a = 123
b = 12345.678
c = 'python'
d = -123

print('/' + '%5d' % a + '/')
print('/' + '%10.2f' % b + '/')
print('/' + '%10.2E' % b + '/')
print('/' + '%10s' % c + '/')
print('/' + '%2d' % a + '/') #印出的位數小於變數還是會印出變數

print('/' + '%-5d' % a + '/')
print('/' + '%-10.2f' % b + '/')
print('/' + '%-10.2E' % b + '/')
print('/' + '%-10s' % c + '/')

print('/' + '%5x' % a + '/')
print('/' + '%5X' % a + '/')
print('/' + '%#5X' % a + '/')
print('/' + '%#5o' % a + '/')
print('/' + '%05d' % a + '/')
print('/' + '%+5d' % a + '/')
print('/' + '%5d%%' % a + '/')

print('/' + '%5d %10.2f %10s' % (a, b, c) + '/')

print('/' + '%12s' % 'abc\tttt' + '/')
print('/' + '%12r' % 'abc\tttt' + '/')

print('/' + '%d' % b + '/')
print('/' + '%.0f' % b + '/') #四捨五入至整數
